[M_Skagzilla2_Adult MissionDefinition]
MissionName="Animal Rescue: Food"
MissionDescription="Once Skaga's wounds are healed, you will notice that he is hungry. Maybe he was given food so he wouldn't get full.."
TurnInDescription="Dakino is old but happy."
MissionSummary="Let's eat when we are hungry.."
MissionGiver="Everything"
MissionTurnInLocation="kingdom"
TeaserText="If you give him a treat, he will probably eat again...."

[M_Skagzilla2_Adult:DogFood2 MissionObjectiveDefinition]
ProgressMessage="Added skoog language"

[M_Skagzilla2_Adult:FeedTheDog MissionObjectiveDefinition]
ProgressMessage="Eat by the Dozen"

[M_Skagzilla2_Adult:FoodDoggie MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Skagzilla2_Adult:SkagDogFoodSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Skagzilla2_Den MissionDefinition]
MissionName="Animal rescue: shelter"
MissionDescription="Now the hungry bugs are eating well and spending their time in their old home. You have to send it to the next hole with more space.."
TurnInDescription="Skag is full and has a new home. Do you think they might need your help for something else in the future?."
MissionSummary="Help the hungry monster find Nate Mair. "
MissionGiver="Duchess"
MissionTurnInLocation="Dukin's"
TeaserText="If you feed the deer, it will be protected in the future...."

[M_Skagzilla2_Den:ClearCave_ObjSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Skagzilla2_Den:ClearOutCave MissionObjectiveDefinition]
ProgressMessage="in the past"

[M_Skagzilla2_Den:FindHome MissionObjectiveDefinition]
ProgressMessage="Finding a new home for Princess"

[M_Skagzilla2_Den:FollowDog MissionObjectiveDefinition]
ProgressMessage="Follow Dukino"

[M_Skagzilla2_Den:FollowDog1_ObjSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Skagzilla2_Pup MissionDefinition]
MissionName="Animal protection: medicine"
MissionDescription="The perfect filter has been created. He is ugly and hungry. Scouts you care for and feed."
TurnInDescription="The more you eat, the better you eat. But he was hungry..."
MissionSummary="Treating and feeding perch is harmful.."
MissionGiver="Dukino"
MissionTurnInLocation="Dukino"
TeaserText="Not all skin types are dangerous."

[M_Skagzilla2_Pup:MissionObjectiveSetDefinition_0 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Skagzilla2_Pup:MissionObjectiveSetDefinition_1 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Skagzilla2_Pup:MissionObjectiveSetDefinition_2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Skagzilla2_Pup:MissionObjectiveSetDefinition_4 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Skagzilla2_Pup:OBJ_PuppyFood MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Skagzilla2_Pup:Skagzilla2Pup_FeedThePuppy MissionObjectiveDefinition]
ProgressMessage="I buy food"

[M_Skagzilla2_Pup:Skagzilla2Pup_FindPuppyFood MissionObjectiveDefinition]
ProgressMessage="Get food at Dokino."

[M_Skagzilla2_Pup:Skagzilla2Pup_FreePuppy MissionObjectiveDefinition]
ProgressMessage="Tocino is free"

[M_Skagzilla2_Pup:Skagzilla2Pup_GiveMedsToPuppy MissionObjectiveDefinition]
ProgressMessage="Medicine Dukino"

[M_Skagzilla2_Pup:Skagzilla2Pup_PickUpMeds MissionObjectiveDefinition]
ProgressMessage="Find dog therapy"

